// 유산소 운동
export const cardioOptions = [
    '트레드 밀',
    '스텝 밀',
    '줄넘기',
    '걷기',
    '조깅 및 러닝 머신',
    '사이클 머신',
    '로잉 머신',
    '버피',
];

// 웨이트 운동: 부위별
export const weightOptions = {
    어깨: [
        '오버헤드 프레스', '덤벨 숄더 프레스', '케이블 프론트 레이즈',
        '사이드 레터럴 레이즈', '업 라이트 로', '원 암 케이블 사이드 레터럴 레이즈',
        '벤트 오버 레터럴 레이즈', '리버스 펙덱 플라이', '페이스 풀'
    ],
    가슴: [
        '인클라인 벤치 프레스', '인클라인 덤벨 프레스', '케이블 크로스 오버(아래 위)',
        '벤치 프레스', '덤벨 프레스', '펙덱 플라이',
        '딥스', '덤벨 풀 오버'
    ],
    등: [
        '오버그립 렛 풀 다운', '풀업', '오버 그립 바벨로우', '케이블 암풀다운',
        '언더 그립 렛 풀다운', '원 암 덤벨 로우', '시티드 로우'
    ],
    이두: [
        '이지바 컬', '케이블 컬',
        '바벨 컬', '덤벨 컬',
        '리버스 바벨 컬', '덤벨 해머 컬'
    ],
    삼두: [
        '오버헤드 트라이셉 익스텐션', '스컬 크러셔',
        '트라이셉 로프 풀 다운', '케이블 트라이셉 푸쉬다운',
        '리버스 그립 트라이셉 푸쉬다운'
    ],
    복부: [
        '크런치', '케이블 크런치',
        '시티드 니업', '플랭크',
        '행잉 레그레이즈', '리버스 크런치',
        '바이시클 크런치', '러시안 트위스트', '사이드 밴드'
    ],
    내전근: [
        '사이드 런지', '힙 어덕터 머신'
    ],
    대퇴사두근: [
        '스쿼트', '레그 프레스', '레그 익스텐션'
    ],
    햄스트링: [
        '레그 컬 머신', '루마니안 데드리프트'
    ],
    둔근: [
        '힙 쓰러스트', '케이블 킥백', '스텝 업'
    ],
    비복근: [
        '스탠딩 카프 레이즈', '시티드 카프 레이즈'
    ],
};
